
&НаКлиенте
Процедура ОтправитьНаСервер(Команда)
	ОтправитьНаСерверНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОтправитьНаСерверНаСервере()
	
	СтрЗапроса = Новый Структура;
	
	СтрЗапроса.Вставить("НомерЗаказа", НомерЗаказа);
	СтрЗапроса.Вставить("НомерБухты", НомерБухты);
	СтрЗапроса.Вставить("Оператор", КодОператора);
	СтрЗапроса.Вставить("ВидПродукции", "СН15");

	СтрЗапроса.Вставить("НомерКонтроллера", 10);
		
	Ответ = ПодключениеКВебСервисуПЛК(СтрЗапроса);
	
	Если Ответ.Информация <> "" Тогда
		Сообщить(Ответ.Информация);	
	Иначе
		ЦветБухты 			= Ответ.Цвет;
		КвадратураЗаказа    = Ответ.Квадратура;
		Оператор			= Ответ.Оператор;
		ОстатокБухты	    = Ответ.Остаток;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Оператор  			= "Шилов Евгений Викторович";
	ЦветБухты 			= "Синий";
	КвадратураЗаказа    = "20 м";	
КонецПроцедуры


