
Функция ПодключениеКВебСервисуПЛК(ПараметрДляОтправкиНаСервер) Экспорт 

	Логин  = "УправлениеСтанками";
	Пароль = "225889";
	ВСОпределение = Новый WSОпределения("http://192.168.1.2/data2013/ws/DataTransfer?wsdl",Логин, Пароль);
	
	ВСервис 	= ВСОпределение.Сервисы.Получить("DataTransfer","DataTransfer");
	ВТочкаВхода = ВСервис.ТочкиПодключения.Получить("DataTransferSoap");
	ВОперация 	= ВТочкаВхода.Интерфейс.Операции.Получить(ПараметрДляОтправкиНаСервер.Операция);	
	
	ВСПрокси 	= Новый WSПрокси(ВСОпределение, "DataTransfer","DataTransfer","DataTransferSoap"); 
	ВСПрокси.Пользователь = Логин;
	ВСПрокси.Пароль       = Пароль;
	
	Если ПараметрДляОтправкиНаСервер.Операция = "FinishOrder" Тогда
		Ответ = СериализаторXDTO.ПрочитатьXDTO(ВСПрокси.FinishOrder(СериализаторXDTO.ЗаписатьXDTO(ПараметрДляОтправкиНаСервер)));
	Иначе	
		Ответ = СериализаторXDTO.ПрочитатьXDTO(ВСПрокси.SendPLK(СериализаторXDTO.ЗаписатьXDTO(ПараметрДляОтправкиНаСервер)));
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции

Функция ОбработкаОшибок(СтрОшибки) Экспорт 
	Если не СтрОшибки.ЕстьОшибка Тогда Возврат Ложь КонецЕсли;

	Сообщить(СтрОшибки.ТекстОшибки, СтатусСообщения.ОченьВажное);
	Возврат Истина;

КонецФункции // ОбработкаОшибок()

Функция ПолучитьИнфуОКонфигурации() Экспорт 
	СтрКонфы = Новый Структура;
	СтрКонфы.Вставить("Конфигурация", Метаданные.Имя);
	СтрКонфы.Вставить("ВерсияПриложения", Метаданные.Версия);
	
	СтрКонфы.Вставить("ID", ?(ЗначениеЗаполнено(Константы.ID.Получить()),Константы.ID.Получить(), Новый УникальныйИдентификатор));
	Возврат СтрКонфы;	
КонецФункции // ПолучитьИнфуОКонфигурации()      
