
&НаСервере
Процедура АвторизацияНаСервере()
	
	СтрЗапроса = Новый Структура;
	СтрЗапроса.Вставить("ТипРегистрации", "Новая регистрация");
	
	#Область СистемнаяИнформация
	СтрИнфо = Новый Структура;
	
	МассивИнфы = Новый Массив;
	МассивИнфы.Добавить("ВерсияОС");
	МассивИнфы.Добавить("ВерсияПриложения");
	МассивИнфы.Добавить("ИдентификаторКлиента");
	МассивИнфы.Добавить("ИнформацияПрограммыПросмотра");
	МассивИнфы.Добавить("ОперативнаяПамять");
	МассивИнфы.Добавить("Процессор");
	МассивИнфы.Добавить("ТипПлатформы");


	Инфо = Новый СистемнаяИнформация;
	Для каждого Стр Из МассивИнфы Цикл
		СтрИнфо.Вставить(Стр, Строка(Инфо[Стр]));		
	КонецЦикла;
	
	СтрЗапроса.Вставить("СитсемнаяИНформация", СтрИнфо);
	#КонецОбласти
	
	#Область Авторизации
	СтрАвторизации = Новый Структура;
	СтрАвторизации.Вставить("НомерТелефона", НомерТелефона);
	СтрАвторизации.Вставить("Почта", Почта);
	СтрАвторизации.Вставить("КодСотрудника",КодСотрудника);
	
	СтрЗапроса.Вставить("АвторизационныеДанные", СтрАвторизации);
	#КонецОбласти

	СтрЗапроса.Вставить("ИнформацияОКонфигурации", ПолучитьИнфуОКонфигурации());
	Ответ = ПодключениеКВебСервису(СтрЗапроса);
	Если ОбработкаОшибок(Ответ.Ошибка) Тогда Возврат; КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Авторизация(Команда)
	АвторизацияНаСервере();
КонецПроцедуры
