
&НаСервере
Процедура ВключитьСмачивательНаСервере(Включить)
	СтрЗапроса = Новый Структура;
	Если Этаформа.элементы.ВключитьСмачиватель.Заголовок = "Включить смачиватель" Тогда
	СтрЗапроса.Вставить("Действие", "ВключитьСмачиватель");
ИНаче
	СтрЗапроса.Вставить("Действие", "ВыключитьСмачиватель");
	КонецЕсли;
	
	Ответ = ПодключениеКВебСервисуПЛК(СтрЗапроса);
	Если ОбработкаОшибок(Ответ.Ошибка) Тогда Возврат; КонецЕсли;
	
	Если Этаформа.элементы.ВключитьСмачиватель.Заголовок = "Выключить смачиватель" Тогда
		Этаформа.элементы.ВключитьСмачиватель.Заголовок = "Включить смачиватель"	
	Иначе
		Этаформа.элементы.ВключитьСмачиватель.Заголовок = "Выключить смачиватель";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВключитьСмачиватель(Команда)
	ВключитьСмачивательНаСервере(Этаформа.элементы.ВключитьСмачиватель.Заголовок = "Включить смачиватель");
КонецПроцедуры

&НаСервере
Процедура УправлениеРычагамиНаСервере()
	Действие = "";
	Если ЭтаФорма.ТекущийЭлемент.Заголовок="НАЛАДКА НП" Тогда 
		 Действие = "НАЛАДКА НП";
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Заголовок="ВВОД ЗАКАЗА" Тогда
		Действие = "ВВОД ЗАКАЗА";
	КонецЕсли;
	
	СтрЗапроса = Новый Структура;
	СтрЗапроса.Вставить("Действие", Действие);
	
	Ответ = ПодключениеКВебСервисуПЛК(СтрЗапроса);
	Если ОбработкаОшибок(Ответ.Ошибка) Тогда Возврат; КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура УправлениеРычагами(Команда)
	УправлениеРычагамиНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СчитатьШК(Команда)
	Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
		ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтаФорма);		
		ОбработчикЗакрытия 	   = Новый ОписаниеОповещения("ОбработкаЗакрытияИнтерфейса", ЭтаФорма);		
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Наведите камеру на штрихкод", ОбработчикСканирования, ОбработчикЗакрытия, ТипШтрихКода.Линейный);
		
	Иначе
		Сообщить("Не поддерживается сканирование штрих-кодов");
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
	ШКЗаказа = Строка(Штрихкод);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСканирования2(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
	ШКБухты = Строка(Штрихкод);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияИнтерфейса(ДополнительныеПараметры) Экспорт
            //
	//СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();			
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихКод(Штрихкод)
	//Если Лев(Штрихкод, 1) = 4 Тогда
	//	ШКЗаказа = Штрихкод;	
	//Иначе
	//	ШКБухты = Штрихкод;
	//КонецЕсли;
	
	//ШКЗаказа = Штрихкод;	
КонецПроцедуры

&НаКлиенте
Процедура СчитатьБухту(Команда)
	Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
		ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования2", ЭтаФорма);		
		ОбработчикЗакрытия 	   = Новый ОписаниеОповещения("ОбработкаЗакрытияИнтерфейса", ЭтаФорма);		
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Наведите камеру на штрихкод", ОбработчикСканирования, ОбработчикЗакрытия, ТипШтрихКода.Линейный);
		
	Иначе
		Сообщить("Не поддерживается сканирование штрих-кодов");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСерверНаСервере()
	
	СтрЗапроса = Новый Структура;
	
	СтрЗапроса.Вставить("ШКНомерЗаказа", ШКЗаказа);
	СтрЗапроса.Вставить("ШКНомерБухты", ШКБухты);
	СтрЗапроса.Вставить("ШКОператора", "1212432423");
	СтрЗапроса.Вставить("НомерКонтроллера", 0);
		
	Ответ = ПодключениеКВебСервисуПЛК(СтрЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСервер(Команда)
	ОтправитьНаСерверНаСервере();
КонецПроцедуры
