
// Новый параметр завершения заказа.
// 
// Возвращаемое значение:
//  Структура - Новый параметр завершения заказа:
// * НомерКонтроллера 
// * УИДЗаказаНаПроизводство
//
Функция НовыйПараметрЗавершенияЗаказа() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("УИДЗаказаНаПроизводство");
	Результат.Вставить("НомерКонтроллера");
	
	Возврат Результат;
	
КонецФункции


// Завершить заказ.
// 
// Параметры:
//  ПараметрЗавершенияЗаказа - См. НовыйПараметрЗавершенияЗаказа
// 
// Возвращаемое значение:
//  Структура - Завершить заказ
//
Функция ЗавершитьЗаказ(ПараметрЗавершенияЗаказа) Экспорт
	
	Пакет = Новый Структура;
	Пакет.Вставить("Операция", "FinishOrder");
	Пакет.Вставить("УникальныйИдентификаторЗаказаНаПроизводство", ПараметрЗавершенияЗаказа.УИДЗаказаНаПроизводство);
	Пакет.Вставить("НомерКонтроллера", ПараметрЗавершенияЗаказа.НомерКонтроллера);
	
	Прокси = НовыйПрокси();
	
	ПакетXDTO = СериализаторXDTO.ЗаписатьXDTO(Пакет);
	ОтветXDTO = Прокси.FinishOrder(ПакетXDTO);
	Ответ = СериализаторXDTO.ПрочитатьXDTO(ОтветXDTO);
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибка", Ответ.Ошибка.ЕстьОшибка);
	Результат.Вставить("ТекстОшибки", Ответ.Ошибка.ТекстОшибки);
	Результат.Вставить("СтатусЗаказа", Ответ.СтатусЗаказа);
	
	Возврат Результат;
	
КонецФункции

////////////////////////

// SendPLK

////////////////////////

Функция НовыйПрокси() 

	Логин  = "УправлениеСтанками";
	Пароль = "225889";
	Определения = Новый WSОпределения("http://192.168.1.2/data2013/ws/DataTransfer?wsdl", Логин, Пароль);
	
	Прокси = Новый WSПрокси(Определения, "DataTransfer","DataTransfer","DataTransferSoap"); 
	Прокси.Пользователь = Логин;
	Прокси.Пароль       = Пароль;
	
	Возврат Прокси;
	
КонецФункции
